import random
# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только 
# по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — 
# на i-ом кусте выросло ai ягод.В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, 
# находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.
def Max(bushNumber):
    if bushNumber<len(bushes)-1:
        return max(bushes[bushNumber], bushes[bushNumber+1], bushes[bushNumber-1])
    else:
         return max(bushes[bushNumber], bushes[0], bushes[bushNumber-1])
bushes = int(input("Enter the number of bushes: "))
bushes = [random.randint(0,100) for _ in range(bushes)]
bushNumber = int(input('Enter the number of the bed: '))-1
print(Max(bushNumber))
